01_Dummy_cases/02_A02_Rotor/03_A02_Dummy_MRF_compressible/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwindV limited;
    div(phi,Urel)       Gauss linearUpwindV limited;

    turbulence 		Gauss upwind;
    div(phi,epsilon)    $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,k)          $turbulence;
    
    //Energy
    div(phi,K)          $turbulence;
    div(phi,h)          $turbulence;
    div(phi,Krel)       $turbulence;

    div(phi,e)          Gauss linearUpwind limited;
    div(phi,(p|rho))    Gauss linearUpwind limited;
    //Rotation
    div(meshPhi,p) 	Gauss linearUpwind limited;
    
    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
    div((nuEff*dev2(T(grad(U)))))	     Gauss linear;
    
    div(((rho*nuEff)*dev2(T(grad(Urel)))))      Gauss linear;
    div((nuEff*dev2(T(grad(Urel)))))	     Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;
}

wallDist
{
    method     meshWave;
}

// ************************************************************************* //
